#+TITLE:  The Road to Emeritus
#+PROPERTY: +header-args:tmux :session ":coop-mode"
#+PROPERTY: +header-args:tmux :results silent
* to render this presentation :noexport:
** ensure client is index.html
#+begin_src shell :results silent
ln -sf emeritus_client.html index.html
#+end_src
** export to reveal.js
#+begin_src elisp :results silent
(org-re-reveal-export-to-html)
#+end_src
* Introduction
* Point One
* Point Two
* Point Three
* Conclusion
* Footnotes :noexport:
** emacs
#+begin_src tmux :session ":emacs"
emacsclient -nw ~/emeritus.org
#+end_src
** environment
** webfolder
#+name: webfolder
#+begin_src elisp
(file-name-directory buffer-file-name)
#+end_src

** spacename
#+name: spacename
#+begin_src shell
echo -n $SPACENAME
#+end_src

#+RESULTS: spacename
#+begin_example
atlas
#+end_example

** webserver
** use our own
We want our webserver to run on port 4000
#+begin_src tmux :session ":present-webserver" :noweb yes
cd <<webfolder()>>
python3 -m http.server  4000
#+end_src
** use original
We want to take over existing web server
#+begin_src tmux :session "servers:web-server" :noweb yes

cd <<webfolder()>>
python3 -m http.server
#+end_src
** REVEAL_VARS
#+NOEXPORT_FILE_NAME: index.html
#+REVEAL_ROOT: https://multiplex.ii.nz
#+REVEAL_MULTIPLEX_URL: https://multiplex.ii.nz/
#+REVEAL_MULTIPLEX_SOCKETIO_URL: https://multiplex.ii.nz/socket.io/socket.io.js
#+REVEAL_VERSION: 4
#+REVEAL_HEAD_PREAMBLE: <link rel="preconnect" href="https://fonts.googleapis.com">
#+REVEAL_HEAD_PREAMBLE: <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
#+REVEAL_EXTRA_CSS: https://unpkg.com/nes.css@2.3.0/css/nes.min.css
#+REVEAL_EXTRA_CSS: https://fonts.googleapis.com/css2?family=Press+Start+2P&display=swap
#+REVEAL_EXTRA_CSS: /stylesheets/infocards.css
#+REVEAL_HLEVEL: 2
#+REVEAL_MARGIN: 0.1
#+REVEAL_WIDTH: 1000
#+REVEAL_HEIGHT: 600
#+REVEAL_MAX_SCALE: 3.5
#+REVEAL_MIN_SCALE: 0.2
#+REVEAL_PLUGINS: (markdown notes highlight multiplex)
#+REVEAL_SLIDE_NUMBER: ""
#+REVEAL_SPEED: 1
#+REVEAL_THEME: simple
#+REVEAL_THEME_OPTIONS: beige|black|blood|league|moon|night|serif|simple|sky|solarized|white
#+REVEAL_TRANS: none
#+REVEAL_TRANS_OPTIONS: none|cube|fade|concave|convex|page|slide|zoom
#+REVEAL_EXTRA_OPTIONS: autoSlide:30000, loop:true
#+REVEAL_PREAMBLE: <script src="/socket.io/socket.io.js"></script><script src="/qrcode.min.js"></script><script src="/prezzie-init.js"></script>
#+REVEAL_MULTIPLEX_SECRET: ', secret: window.secret, undefined:'
#+REVEAL_MULTIPLEX_ID: ', id: window.socketID, undefined: '
#+REVEAL_MULTIPLEX_URL: https://multiplex.ii.nz
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: mathjax:Y
#+OPTIONS: reveal_single_file:nil
#+OPTIONS: reveal_control:t
#+OPTIONS: reveal-progress:t
#+OPTIONS: reveal_history:nil
#+OPTIONS: reveal_center:t
#+OPTIONS: reveal_rolling_links:nil
#+OPTIONS: reveal_keyboard:t
#+OPTIONS: author:nil
#+OPTIONS: timestamp:nil
